# This is a sample Python script.

# Press Shift+F10 to execute it or replace it with your code.
# Press Double Shift to search everywhere for classes, files, tool windows, actions, and settings.


def print_hi(name):
    # Use a breakpoint in the code line below to debug your script.
    print(f'Hi, {name}')  # Press Ctrl+F8 to toggle the breakpoint.


# Press the green button in the gutter to run the script.
if __name__ == '__main__':
    print_hi('PyCharm')

#TODO Создать приложение blog
# Создать два дополнительных маршрута blog/...
# Придумать какие поля будут в таблице данного приложения
# Существующие типы полей в БД можно посмотреть здесь: https://oracleplsql.ru/data-types-sqlite.html

#TODO (Опционально) Скачать SqLiteStudio

#TODO Продолжить выполнение заданий на сайте степика

#TODO Попробовать вернуть в качестве ответа html страничку (на маршруте blog/)

#TODO Вспомнил расшифровку:
# MCV - MTV
# Model - Model
# Controller - Template
# View - View